{
    ".net": 0,
    "1c": 1,
    "1c api": 2,
    "accessibility": 3,
    "accessibility best practices": 4,
    "accessibility guidelines": 5,
    "accessibility principles": 6,
    "accessibility standards": 7,
    "accessibility standards (wcag)": 8,
    "adobe xd": 9,
    "agile": 10,
    "agile methodologies": 11,
    "agile methodologies (scrum": 12,
    "agile methodologies (scrum/kanban)": 13,
    "agile testing": 14,
    "agile testing methodologies": 15,
    "airflow": 16,
    "alamofire": 17,
    "android": 18,
    "android sdk": 19,
    "android sdk/ios sdk": 20,
    "android studio": 21,
    "angular": 22,
    "angular cli": 23,
    "angular material": 24,
    "ansible": 25,
    "api design": 26,
    "api documentation": 27,
    "api documentation (swagger/openapi)": 28,
    "api testing": 29,
    "api testing tools (postman": 30,
    "appium": 31,
    "asana": 32,
    "automated testing": 33,
    "automation testing": 34,
    "aws": 35,
    "aws (s3": 36,
    "aws s3": 37,
    "aws sagemaker": 38,
    "aws/azure": 39,
    "aws/azure/gcp": 40,
    "aws/azure/gcp (basic)": 41,
    "aws/gcp": 42,
    "aws/gcp/azure": 43,
    "aws/gcp/azure (basic understanding)": 44,
    "aws/gcp/azure (basic)": 45,
    "aws/gcp/azure (basics)": 46,
    "aws/gcp/azure (one of them)": 47,
    "aws/google cloud": 48,
    "aws/google cloud platform": 49,
    "axure)": 50,
    "azure": 51,
    "backup and recovery": 52,
    "backups": 53,
    "balsamiq": 54,
    "bash": 55,
    "bash scripting": 56,
    "beautiful soup": 57,
    "beautifulsoup": 58,
    "big data": 59,
    "bigquery": 60,
    "bigquery/snowflake (if applicable)": 61,
    "bitrix24 api": 62,
    "blender": 63,
    "bluetooth le": 64,
    "bootstrap": 65,
    "bpmn": 66,
    "brainflow": 67,
    "browser compatibility testing": 68,
    "budgeting tools": 69,
    "bug reporting": 70,
    "bug tracking": 71,
    "bug tracking and reporting": 72,
    "bug tracking systems (jira)": 73,
    "c#": 74,
    "c++": 75,
    "c/c++": 76,
    "celery": 77,
    "cheerio": 78,
    "ci/cd": 79,
    "ci/cd (jenkins/gitlab ci)": 80,
    "ci/cd pipelines": 81,
    "ci/cd pipelines (jenkins": 82,
    "ci/cd pipelines (jenkins/gitlab ci)": 83,
    "ci/cd pipelines (jenkins/gitlab ci/github actions)": 84,
    "cloud security": 85,
    "cloud security best practices": 86,
    "cloud sql": 87,
    "cocoa touch": 88,
    "cocoapods": 89,
    "cocoapods/swift package manager": 90,
    "color theory": 91,
    "combine": 92,
    "communication & collaboration tools (slack": 93,
    "communication skills": 94,
    "communication tools (slack": 95,
    "confluence": 96,
    "core data": 97,
    "coredata": 98,
    "coroutines": 99,
    "css": 100,
    "css3": 101,
    "cucumber": 102,
    "cypress": 103,
    "cypress)": 104,
    "d3.js": 105,
    "dagger": 106,
    "dagger/hilt": 107,
    "data backup and recovery": 108,
    "data cleaning": 109,
    "data cleaning and preprocessing": 110,
    "data migration": 111,
    "data mining": 112,
    "data mining techniques": 113,
    "data modeling": 114,
    "data security": 115,
    "data storytelling": 116,
    "data visualization": 117,
    "data visualization (matplotlib": 118,
    "data visualization (matplotlib/seaborn)": 119,
    "data visualization libraries": 120,
    "data visualization libraries (matplotlib": 121,
    "data visualization techniques": 122,
    "data visualization tools": 123,
    "data visualization tools (matplotlib": 124,
    "data wrangling": 125,
    "database design": 126,
    "database optimization": 127,
    "database performance tuning": 128,
    "database security": 129,
    "dataflow": 130,
    "dataproc)": 131,
    "dds": 132,
    "deep learning": 133,
    "defect tracking": 134,
    "design patterns": 135,
    "design systems": 136,
    "design thinking": 137,
    "django": 138,
    "django/flask": 139,
    "docker": 140,
    "documentation": 141,
    "ec2": 142,
    "emr)": 143,
    "enzyme": 144,
    "esp32": 145,
    "etc.)": 146,
    "etl": 147,
    "excel": 148,
    "express": 149,
    "express.js": 150,
    "figma": 151,
    "figma/adobe xd": 152,
    "figma/sketch": 153,
    "figma/sketch/adobe xd": 154,
    "figma/sketch/adobe xd (one of them)": 155,
    "filterpy": 156,
    "firebase": 157,
    "flask": 158,
    "flask/django": 159,
    "flutter/react native": 160,
    "gantt charts": 161,
    "gazebo": 162,
    "gcp": 163,
    "gcp (bigquery": 164,
    "gdal": 165,
    "gensim": 166,
    "gis": 167,
    "git": 168,
    "github": 169,
    "gitlab": 170,
    "gitlab ci": 171,
    "gitlab ci)": 172,
    "go": 173,
    "godot": 174,
    "google docs": 175,
    "google sheets": 176,
    "google workspace": 177,
    "gpt": 178,
    "gpu": 179,
    "gradle": 180,
    "grafana)": 181,
    "graphql": 182,
    "hadoop": 183,
    "headhunter api": 184,
    "hive": 185,
    "html": 186,
    "html5": 187,
    "hugging face transformers": 188,
    "information architecture": 189,
    "interaction design": 190,
    "invision": 191,
    "ios sdk": 192,
    "jasmine": 193,
    "java": 194,
    "java/android sdk": 195,
    "javascript": 196,
    "jenkins": 197,
    "jest": 198,
    "jest/cypress": 199,
    "jest/mocha": 200,
    "jetpack compose": 201,
    "jira": 202,
    "jmeter": 203,
    "junit": 204,
    "junit/pytest": 205,
    "jupyter notebook": 206,
    "kafka": 207,
    "kanban": 208,
    "kanban)": 209,
    "karma": 210,
    "keras": 211,
    "kotlin": 212,
    "kubernetes": 213,
    "laravel": 214,
    "leadership": 215,
    "leaflet": 216,
    "librosa": 217,
    "linux": 218,
    "linux command line": 219,
    "llm": 220,
    "loadrunner)": 221,
    "lucidchart": 222,
    "machine learning": 223,
    "machine learning (scikit-learn": 224,
    "machine learning algorithms": 225,
    "machine learning basics": 226,
    "manual testing": 227,
    "material design": 228,
    "material ui": 229,
    "material ui/bootstrap": 230,
    "matplotlib": 231,
    "mavlink": 232,
    "microsoft office suite": 233,
    "microsoft project": 234,
    "microsoft teams": 235,
    "microsoft teams)": 236,
    "mirapolis": 237,
    "mirapolis api": 238,
    "mne": 239,
    "mobile testing": 240,
    "mongodb": 241,
    "monitoring tools": 242,
    "monitoring tools (prometheus": 243,
    "monitoring tools (prometheus/grafana)": 244,
    "moveit": 245,
    "ms project": 246,
    "ms teams)": 247,
    "ms visio": 248,
    "msf": 249,
    "multi-agent path finding (mapf)": 250,
    "multi-agent systems": 251,
    "mvp/mvvm": 252,
    "mvvm": 253,
    "mvvm architecture": 254,
    "mysql": 255,
    "navigation stack": 256,
    "neo4j": 257,
    "networking": 258,
    "networkx": 259,
    "next.js": 260,
    "next.js/nuxt.js": 261,
    "next.js/vue.js/angular": 262,
    "ngrx": 263,
    "nlp": 264,
    "nltk": 265,
    "node.js": 266,
    "nosql": 267,
    "nosql (mongodb)": 268,
    "nosql databases": 269,
    "notion": 270,
    "npm": 271,
    "npm/yarn": 272,
    "numpy": 273,
    "numpy)": 274,
    "objective-c": 275,
    "ocr": 276,
    "openai gym": 277,
    "openapi": 278,
    "openapi/swagger": 279,
    "opencv": 280,
    "openmvg": 281,
    "openmvs": 282,
    "openpose": 283,
    "or-tools": 284,
    "owl": 285,
    "pandas": 286,
    "pcl": 287,
    "pdal": 288,
    "pdfminer": 289,
    "performance testing": 290,
    "performance testing tools (jmeter": 291,
    "performance tuning": 292,
    "php": 293,
    "playwright)": 294,
    "postgresql": 295,
    "postgresql/mysql": 296,
    "postgresql/mysql/mongodb": 297,
    "postman": 298,
    "power bi": 299,
    "problem solving": 300,
    "problem-solving": 301,
    "process improvement": 302,
    "project planning": 303,
    "project planning & budgeting": 304,
    "prompt engineering": 305,
    "prototyping": 306,
    "prototyping tools": 307,
    "prototyping tools (e.g.": 308,
    "proxychains": 309,
    "puppeteer": 310,
    "px4": 311,
    "pymupdf": 312,
    "pyqt": 313,
    "pytest": 314,
    "pytest)": 315,
    "pytest/jest": 316,
    "pytest/jest/cypress": 317,
    "pytest/junit": 318,
    "pytest/selenium": 319,
    "pytest/unittest": 320,
    "python": 321,
    "python (pandas": 322,
    "python (pytest)": 323,
    "pytorch": 324,
    "pyzbar": 325,
    "qgis": 326,
    "r": 327,
    "rag": 328,
    "rdf": 329,
    "react": 330,
    "react js": 331,
    "react router": 332,
    "react/angular/vue": 333,
    "react/angular/vue.js": 334,
    "react/vue/angular": 335,
    "react/vue/angular (one of them)": 336,
    "realm": 337,
    "redis": 338,
    "redux": 339,
    "redux toolkit": 340,
    "redux/mobx": 341,
    "redux/vuex": 342,
    "redux/vuex/angularjs": 343,
    "redux/vuex/angularjs (relevant to chosen framework)": 344,
    "redux/vuex/flux": 345,
    "redux/vuex/mobx": 346,
    "redux/vuex/ngrx": 347,
    "redux/vuex/pinia": 348,
    "reporting & tracking": 349,
    "requests": 350,
    "requirements gathering": 351,
    "responsive design": 352,
    "responsive design principles": 353,
    "rest": 354,
    "rest api": 355,
    "rest api consumption": 356,
    "rest apis": 357,
    "rest assured": 358,
    "rest-assured": 359,
    "restassured": 360,
    "restassured)": 361,
    "retrofit": 362,
    "risc-v": 363,
    "risk management": 364,
    "risk management tools": 365,
    "room": 366,
    "room persistence library": 367,
    "ros": 368,
    "rxjava": 369,
    "rxjs": 370,
    "sap": 371,
    "sass/less": 372,
    "schedule": 373,
    "schema design": 374,
    "scikit-learn": 375,
    "scikit-learn)": 376,
    "scipy": 377,
    "scrapy": 378,
    "scrum": 379,
    "scss": 380,
    "seaborn": 381,
    "seaborn)": 382,
    "security": 383,
    "security testing": 384,
    "selenium": 385,
    "shell scripting": 386,
    "shiny": 387,
    "sketch": 388,
    "slack": 389,
    "slam": 390,
    "smtplib": 391,
    "snowflake": 392,
    "software testing methodologies": 393,
    "spacy": 394,
    "spark": 395,
    "speechrecognition": 396,
    "splash": 397,
    "spring": 398,
    "spring framework": 399,
    "sql": 400,
    "sql injection prevention": 401,
    "sql optimization": 402,
    "sql server": 403,
    "sqlalchemy": 404,
    "sqlite": 405,
    "stable baselines": 406,
    "stakeholder management": 407,
    "statistical analysis": 408,
    "statistical modeling": 409,
    "stm32": 410,
    "storybook": 411,
    "styled-components": 412,
    "swift": 413,
    "swift package manager": 414,
    "swift ui": 415,
    "swift/kotlin": 416,
    "swift/swiftui": 417,
    "swiftui": 418,
    "tableau": 419,
    "tableau/power bi": 420,
    "tailwind css": 421,
    "tailwind css/bootstrap": 422,
    "task management": 423,
    "team leadership": 424,
    "team management": 425,
    "teamwork": 426,
    "telegram bot api": 427,
    "tensorflow": 428,
    "tensorflow/pytorch": 429,
    "tensorflow/pytorch)": 430,
    "terraform": 431,
    "terraform/ansible": 432,
    "test automation": 433,
    "test automation frameworks": 434,
    "test automation frameworks (selenium": 435,
    "test case design": 436,
    "test documentation": 437,
    "test execution": 438,
    "test management tools (jira": 439,
    "test planning": 440,
    "testing frameworks (e.g.": 441,
    "testing frameworks (jest": 442,
    "testing frameworks (jest/cypress)": 443,
    "testing frameworks (pytest/unittest)": 444,
    "testng": 445,
    "testrail": 446,
    "testrail)": 447,
    "testrail/jira": 448,
    "time management": 449,
    "tor": 450,
    "transformers": 451,
    "trello": 452,
    "twilio api": 453,
    "typescript": 454,
    "typography": 455,
    "ui design principles": 456,
    "ui prototyping": 457,
    "ui testing": 458,
    "ui/ux design principles": 459,
    "ui/ux principles": 460,
    "uikit": 461,
    "uml": 462,
    "unit testing": 463,
    "unit testing (pytest)": 464,
    "unit testing (pytest/unittest)": 465,
    "unit testing frameworks": 466,
    "unittest)": 467,
    "unity": 468,
    "usability testing": 469,
    "user experience design": 470,
    "user interface design": 471,
    "user research": 472,
    "user research methodologies": 473,
    "user testing": 474,
    "ux best practices": 475,
    "ux design principles": 476,
    "ux research": 477,
    "ux research methodologies": 478,
    "ux writing": 479,
    "ux/ui principles": 480,
    "visual design": 481,
    "visual design principles": 482,
    "vue": 483,
    "vue.js": 484,
    "webpack": 485,
    "webpack/parcel": 486,
    "wireframing": 487,
    "wpf": 488,
    "xcode": 489,
    "xcode/android studio": 490,
    "xml": 491,
    "yandex cloud": 492,
    "yandex.maps api": 493,
    "yarn": 494,
    "zbar": 495,
    "zeplin": 496
}