{
    "3d animator": 0,
    "ai/ml-инженер": 1,
    "algorithm developer": 2,
    "android-разработчик": 3,
    "angular-разработчик": 4,
    "api-интегратор": 5,
    "backend developer": 6,
    "backend-разработчик": 7,
    "bot developer": 8,
    "computer vision engineer": 9,
    "control systems engineer": 10,
    "data analyst": 11,
    "data analyst/scientist (if applicable to the project)": 12,
    "data analyst/scientist (if applicable)": 13,
    "data analyst/scientist (optional": 14,
    "data engineer": 15,
    "data scientist": 16,
    "data scientist (computer vision)": 17,
    "data scientist (optional": 18,
    "data scientist/analyst": 19,
    "data scientist/analyst (depending on project)": 20,
    "data scientist/analyst (if applicable": 21,
    "data scientist/analyst (if applicable to the project)": 22,
    "data scientist/analyst (if applicable)": 23,
    "data scientist/analyst (optional": 24,
    "database administrator": 25,
    "database architect": 26,
    "depending on project scope)": 27,
    "depending on project)": 28,
    "depends on project)": 29,
    "desktop app developer": 30,
    "devops engineer": 31,
    "education management consultant": 32,
    "flight control engineer": 33,
    "frontend developer": 34,
    "frontend-разработчик": 35,
    "full-stack developer": 36,
    "gis developer": 37,
    "gis specialist": 38,
    "gis-аналитик": 39,
    "hr specialist": 40,
    "ios-разработчик": 41,
    "llm engineer": 42,
    "llm-специалист": 43,
    "machine learning engineer": 44,
    "manipulation engineer": 45,
    "medical consultant": 46,
    "ml engineer": 47,
    "mobile developer": 48,
    "mobile developer (android)": 49,
    "mobile developer (if applicable)": 50,
    "mobile developer (ios)": 51,
    "mobile developer (ios/android)": 52,
    "multi-robot systems engineer": 53,
    "music theorist": 54,
    "navigation engineer": 55,
    "neuroscientist/psychologist": 56,
    "nlp engineer": 57,
    "operations research specialist": 58,
    "otherwise replace with another role)": 59,
    "otherwise replace with devops engineer)": 60,
    "photogrammetry engineer": 61,
    "project manager": 62,
    "prompt engineer": 63,
    "python developer": 64,
    "qa engineer": 65,
    "qa engineer/devops engineer": 66,
    "qa-инженер": 67,
    "react-разработчик": 68,
    "reinforcement learning engineer": 69,
    "robotics engineer": 70,
    "slam engineer": 71,
    "software architect": 72,
    "software developer": 73,
    "speech processing engineer": 74,
    "ui/ux designer": 75,
    "ui/ux designer (if applicable": 76,
    "ux/ui designer": 77,
    "web scraper": 78,
    "web-разработчик": 79,
    "бизнес-аналитик": 80,
    "бэкэнд-разработчик": 81,
    "дизайнер": 82,
    "исследователь": 83,
    "мобильный разработчик": 84,
    "программист/3d": 85,
    "программист/backend": 86,
    "программист/frontend": 87,
    "программист/ml": 88,
    "проектный менеджер": 89,
    "разработчик модулей для scivi": 90,
    "разработчик модулей для устройств iot": 91,
    "системный аналитик": 92,
    "тестировщик": 93,
    "технический аналитик": 94,
    "технический директор / архитектор": 95,
    "технический писатель": 96,
    "фронтенд-разработчик": 97
}