{
    ".net": 0,
    "1c": 1,
    "1c api": 2,
    "accessibility": 3,
    "accessibility guidelines": 4,
    "accessibility principles": 5,
    "accessibility standards": 6,
    "accessibility standards (wcag)": 7,
    "adobe xd": 8,
    "agile": 9,
    "agile methodologies": 10,
    "agile methodologies (scrum": 11,
    "agile methodologies (scrum/kanban)": 12,
    "agile testing": 13,
    "agile testing methodologies": 14,
    "airflow": 15,
    "alamofire": 16,
    "android": 17,
    "android sdk": 18,
    "android sdk/ios sdk": 19,
    "android studio": 20,
    "angular": 21,
    "angular cli": 22,
    "angular material": 23,
    "ansible": 24,
    "api design": 25,
    "api documentation": 26,
    "api documentation (swagger/openapi)": 27,
    "api testing": 28,
    "api testing tools (postman": 29,
    "appium": 30,
    "asana": 31,
    "automated testing": 32,
    "automation testing": 33,
    "aws": 34,
    "aws (s3": 35,
    "aws sagemaker": 36,
    "aws/azure/gcp": 37,
    "aws/azure/gcp (basic)": 38,
    "aws/gcp": 39,
    "aws/gcp/azure": 40,
    "aws/gcp/azure (basic understanding)": 41,
    "aws/gcp/azure (basic)": 42,
    "aws/gcp/azure (basics)": 43,
    "aws/gcp/azure (one of them)": 44,
    "aws/google cloud": 45,
    "aws/google cloud platform": 46,
    "axure)": 47,
    "azure": 48,
    "backup and recovery": 49,
    "balsamiq": 50,
    "bash": 51,
    "bash scripting": 52,
    "beautiful soup": 53,
    "beautifulsoup": 54,
    "big data": 55,
    "bigquery": 56,
    "bigquery/snowflake (if applicable)": 57,
    "bitrix24 api": 58,
    "blender": 59,
    "bluetooth le": 60,
    "bootstrap": 61,
    "bpmn": 62,
    "brainflow": 63,
    "browser compatibility testing": 64,
    "bug reporting": 65,
    "bug tracking": 66,
    "bug tracking and reporting": 67,
    "bug tracking systems (jira)": 68,
    "c#": 69,
    "c++": 70,
    "c/c++": 71,
    "celery": 72,
    "cheerio": 73,
    "ci/cd": 74,
    "ci/cd (jenkins/gitlab ci)": 75,
    "ci/cd pipelines": 76,
    "ci/cd pipelines (jenkins": 77,
    "ci/cd pipelines (jenkins/gitlab ci)": 78,
    "ci/cd pipelines (jenkins/gitlab ci/github actions)": 79,
    "cloud security": 80,
    "cloud security best practices": 81,
    "cloud sql": 82,
    "cocoa touch": 83,
    "cocoapods": 84,
    "cocoapods/swift package manager": 85,
    "color theory": 86,
    "combine": 87,
    "communication & collaboration tools (slack": 88,
    "communication skills": 89,
    "confluence": 90,
    "core data": 91,
    "coredata": 92,
    "coroutines": 93,
    "css": 94,
    "css3": 95,
    "cucumber": 96,
    "cypress": 97,
    "cypress)": 98,
    "d3.js": 99,
    "dagger": 100,
    "dagger/hilt": 101,
    "data cleaning": 102,
    "data cleaning and preprocessing": 103,
    "data migration": 104,
    "data mining": 105,
    "data mining techniques": 106,
    "data modeling": 107,
    "data security": 108,
    "data storytelling": 109,
    "data visualization": 110,
    "data visualization (matplotlib": 111,
    "data visualization (matplotlib/seaborn)": 112,
    "data visualization libraries (matplotlib": 113,
    "data visualization tools (matplotlib": 114,
    "data wrangling": 115,
    "database design": 116,
    "database optimization": 117,
    "dataflow": 118,
    "dataproc)": 119,
    "dds": 120,
    "deep learning": 121,
    "defect tracking": 122,
    "design patterns": 123,
    "design systems": 124,
    "design thinking": 125,
    "django": 126,
    "django/flask": 127,
    "docker": 128,
    "documentation": 129,
    "ec2": 130,
    "emr)": 131,
    "enzyme": 132,
    "esp32": 133,
    "etc.)": 134,
    "etl": 135,
    "express": 136,
    "express.js": 137,
    "figma": 138,
    "figma/adobe xd": 139,
    "figma/sketch": 140,
    "figma/sketch/adobe xd": 141,
    "figma/sketch/adobe xd (one of them)": 142,
    "filterpy": 143,
    "firebase": 144,
    "flask": 145,
    "flask/django": 146,
    "flutter/react native": 147,
    "gantt charts": 148,
    "gazebo": 149,
    "gcp": 150,
    "gcp (bigquery": 151,
    "gdal": 152,
    "gensim": 153,
    "gis": 154,
    "git": 155,
    "github": 156,
    "gitlab": 157,
    "gitlab ci": 158,
    "gitlab ci)": 159,
    "go": 160,
    "godot": 161,
    "google docs": 162,
    "google sheets": 163,
    "google workspace": 164,
    "gpt": 165,
    "gpu": 166,
    "gradle": 167,
    "grafana)": 168,
    "graphql": 169,
    "hadoop": 170,
    "headhunter api": 171,
    "hive": 172,
    "html": 173,
    "html5": 174,
    "hugging face transformers": 175,
    "information architecture": 176,
    "interaction design": 177,
    "invision": 178,
    "ios sdk": 179,
    "jasmine": 180,
    "java": 181,
    "java/android sdk": 182,
    "javascript": 183,
    "jenkins": 184,
    "jest": 185,
    "jest/cypress": 186,
    "jest/mocha": 187,
    "jetpack compose": 188,
    "jira": 189,
    "jmeter": 190,
    "junit": 191,
    "junit/pytest": 192,
    "jupyter notebook": 193,
    "kafka": 194,
    "kanban": 195,
    "kanban)": 196,
    "karma": 197,
    "keras": 198,
    "kotlin": 199,
    "kubernetes": 200,
    "laravel": 201,
    "leadership": 202,
    "leaflet": 203,
    "librosa": 204,
    "linux": 205,
    "linux command line": 206,
    "llm": 207,
    "loadrunner)": 208,
    "lucidchart": 209,
    "machine learning": 210,
    "machine learning (scikit-learn": 211,
    "machine learning algorithms": 212,
    "machine learning basics": 213,
    "manual testing": 214,
    "material design": 215,
    "material ui": 216,
    "material ui/bootstrap": 217,
    "matplotlib": 218,
    "mavlink": 219,
    "microsoft office suite": 220,
    "microsoft project": 221,
    "microsoft teams": 222,
    "mirapolis": 223,
    "mirapolis api": 224,
    "mne": 225,
    "mobile testing": 226,
    "mongodb": 227,
    "monitoring tools": 228,
    "monitoring tools (prometheus": 229,
    "monitoring tools (prometheus/grafana)": 230,
    "moveit": 231,
    "ms project": 232,
    "ms teams)": 233,
    "ms visio": 234,
    "msf": 235,
    "multi-agent path finding (mapf)": 236,
    "multi-agent systems": 237,
    "mvp/mvvm": 238,
    "mvvm": 239,
    "mvvm architecture": 240,
    "mysql": 241,
    "navigation stack": 242,
    "neo4j": 243,
    "networking": 244,
    "networkx": 245,
    "next.js": 246,
    "next.js/nuxt.js": 247,
    "next.js/vue.js/angular": 248,
    "ngrx": 249,
    "nlp": 250,
    "nltk": 251,
    "node.js": 252,
    "nosql": 253,
    "nosql (mongodb)": 254,
    "nosql databases": 255,
    "notion": 256,
    "npm": 257,
    "npm/yarn": 258,
    "numpy": 259,
    "numpy)": 260,
    "objective-c": 261,
    "ocr": 262,
    "openai gym": 263,
    "openapi": 264,
    "openapi/swagger": 265,
    "opencv": 266,
    "openmvg": 267,
    "openmvs": 268,
    "openpose": 269,
    "or-tools": 270,
    "owl": 271,
    "pandas": 272,
    "pcl": 273,
    "pdal": 274,
    "pdfminer": 275,
    "performance testing": 276,
    "performance testing tools (jmeter": 277,
    "php": 278,
    "playwright)": 279,
    "postgresql": 280,
    "postgresql/mysql": 281,
    "postgresql/mysql/mongodb": 282,
    "postman": 283,
    "power bi": 284,
    "problem solving": 285,
    "problem-solving": 286,
    "process improvement": 287,
    "project planning": 288,
    "project planning & budgeting": 289,
    "prompt engineering": 290,
    "prototyping": 291,
    "prototyping tools (e.g.": 292,
    "proxychains": 293,
    "puppeteer": 294,
    "px4": 295,
    "pymupdf": 296,
    "pyqt": 297,
    "pytest": 298,
    "pytest)": 299,
    "pytest/jest": 300,
    "pytest/jest/cypress": 301,
    "pytest/junit": 302,
    "pytest/selenium": 303,
    "pytest/unittest": 304,
    "python": 305,
    "python (pandas": 306,
    "python (pytest)": 307,
    "pytorch": 308,
    "pyzbar": 309,
    "qgis": 310,
    "r": 311,
    "rag": 312,
    "rdf": 313,
    "react": 314,
    "react js": 315,
    "react router": 316,
    "react/angular/vue": 317,
    "react/angular/vue.js": 318,
    "react/vue/angular": 319,
    "react/vue/angular (one of them)": 320,
    "realm": 321,
    "redis": 322,
    "redux": 323,
    "redux toolkit": 324,
    "redux/mobx": 325,
    "redux/vuex": 326,
    "redux/vuex/angularjs": 327,
    "redux/vuex/angularjs (relevant to chosen framework)": 328,
    "redux/vuex/flux": 329,
    "redux/vuex/mobx": 330,
    "redux/vuex/ngrx": 331,
    "redux/vuex/pinia": 332,
    "reporting & tracking": 333,
    "requests": 334,
    "requirements gathering": 335,
    "responsive design": 336,
    "responsive design principles": 337,
    "rest": 338,
    "rest api": 339,
    "rest api consumption": 340,
    "rest assured": 341,
    "rest-assured": 342,
    "restassured": 343,
    "restassured)": 344,
    "retrofit": 345,
    "risc-v": 346,
    "risk management": 347,
    "room": 348,
    "room persistence library": 349,
    "ros": 350,
    "rxjava": 351,
    "rxjs": 352,
    "sap": 353,
    "sass/less": 354,
    "schedule": 355,
    "schema design": 356,
    "scikit-learn": 357,
    "scikit-learn)": 358,
    "scipy": 359,
    "scrapy": 360,
    "scrum": 361,
    "scss": 362,
    "seaborn": 363,
    "seaborn)": 364,
    "security testing": 365,
    "selenium": 366,
    "shell scripting": 367,
    "shiny": 368,
    "sketch": 369,
    "slack": 370,
    "slam": 371,
    "smtplib": 372,
    "snowflake": 373,
    "software testing methodologies": 374,
    "spacy": 375,
    "spark": 376,
    "speechrecognition": 377,
    "splash": 378,
    "spring": 379,
    "spring framework": 380,
    "sql": 381,
    "sql injection prevention": 382,
    "sqlalchemy": 383,
    "sqlite": 384,
    "stable baselines": 385,
    "stakeholder management": 386,
    "statistical analysis": 387,
    "statistical modeling": 388,
    "stm32": 389,
    "storybook": 390,
    "styled-components": 391,
    "swift": 392,
    "swift package manager": 393,
    "swift ui": 394,
    "swift/kotlin": 395,
    "swift/swiftui": 396,
    "swiftui": 397,
    "tableau": 398,
    "tableau/power bi": 399,
    "tailwind css": 400,
    "tailwind css/bootstrap": 401,
    "task management": 402,
    "team leadership": 403,
    "team management": 404,
    "teamwork": 405,
    "telegram bot api": 406,
    "tensorflow": 407,
    "tensorflow/pytorch": 408,
    "tensorflow/pytorch)": 409,
    "terraform": 410,
    "terraform/ansible": 411,
    "test automation": 412,
    "test automation frameworks": 413,
    "test automation frameworks (selenium": 414,
    "test case design": 415,
    "test documentation": 416,
    "test execution": 417,
    "test management tools (jira": 418,
    "test planning": 419,
    "testing frameworks (e.g.": 420,
    "testing frameworks (jest": 421,
    "testing frameworks (jest/cypress)": 422,
    "testing frameworks (pytest/unittest)": 423,
    "testng": 424,
    "testrail": 425,
    "testrail)": 426,
    "testrail/jira": 427,
    "time management": 428,
    "tor": 429,
    "transformers": 430,
    "trello": 431,
    "twilio api": 432,
    "typescript": 433,
    "typography": 434,
    "ui design principles": 435,
    "ui testing": 436,
    "ui/ux principles": 437,
    "uikit": 438,
    "uml": 439,
    "unit testing": 440,
    "unit testing (pytest)": 441,
    "unit testing (pytest/unittest)": 442,
    "unit testing frameworks": 443,
    "unittest)": 444,
    "unity": 445,
    "usability testing": 446,
    "user experience design": 447,
    "user interface design": 448,
    "user research": 449,
    "user research methodologies": 450,
    "user testing": 451,
    "ux design principles": 452,
    "ux writing": 453,
    "ux/ui principles": 454,
    "visual design": 455,
    "visual design principles": 456,
    "vue": 457,
    "vue.js": 458,
    "webpack": 459,
    "webpack/parcel": 460,
    "wireframing": 461,
    "wpf": 462,
    "xcode": 463,
    "xcode/android studio": 464,
    "yandex cloud": 465,
    "yandex.maps api": 466,
    "yarn": 467,
    "zbar": 468
}